<!DOCTYPE html>
<html lang="fr">
<head>
  <meta charset="UTF-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <title>Politique de confidentialit&eacute; - SuiviBaby</title>
  <style>
    * { margin: 0; padding: 0; box-sizing: border-box; }
    body { font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Roboto, sans-serif; background: #f9fafb; color: #1f2937; line-height: 1.6; padding: 20px; }
    .container { max-width: 720px; margin: 0 auto; background: #fff; border-radius: 16px; padding: 40px; box-shadow: 0 1px 3px rgba(0,0,0,0.1); }
    h1 { font-size: 28px; text-align: center; margin-bottom: 8px; color: #111827; }
    .date { text-align: center; color: #6b7280; font-size: 14px; margin-bottom: 32px; }
    .intro { font-size: 15px; color: #4b5563; margin-bottom: 32px; }
    h2 { font-size: 17px; color: #111827; margin-bottom: 8px; margin-top: 24px; }
    p { font-size: 14px; color: #4b5563; margin-bottom: 16px; }
    .footer { margin-top: 32px; padding-top: 20px; border-top: 1px solid #e5e7eb; text-align: center; font-size: 14px; color: #6b7280; }
    a { color: #6366f1; text-decoration: none; }
  </style>
</head>
<body>
  <div class="container">
    <h1>Politique de confidentialit&eacute;</h1>
    <p class="date">Derni&egrave;re mise &agrave; jour : 1er janvier 2026</p>
    <p class="intro">Chez SuiviBaby, la protection de vos donn&eacute;es personnelles est notre priorit&eacute; absolue. Cette politique explique comment nous collectons, utilisons et prot&eacute;geons vos informations.</p>

    <h2>1. Responsable du traitement</h2>
    <p>Le service SuiviBaby est op&eacute;r&eacute; par Yoss, situ&eacute; &agrave; Paris, France. Pour toute question relative &agrave; la protection de vos donn&eacute;es, vous pouvez nous contacter &agrave; l'adresse : <a href="mailto:privacy@suivibaby.com">privacy@suivibaby.com</a>.</p>

    <h2>2. Nature des donn&eacute;es collect&eacute;es</h2>
    <p>Compte : Adresse email, pseudonyme. Donn&eacute;es de l'enfant (cat&eacute;gories particuli&egrave;res de donn&eacute;es) : Pr&eacute;nom, date de naissance, sexe, et journal de bord de l'enfant (alimentation, sommeil, hygi&egrave;ne, sant&eacute;, mesures de croissance). Ces donn&eacute;es sont trait&eacute;es uniquement pour vous fournir les fonctionnalit&eacute;s de suivi de l'application.</p>

    <h2>3. Base l&eacute;gale et Consentement aux donn&eacute;es de sant&eacute;</h2>
    <p>Le traitement des donn&eacute;es de suivi de l'enfant (donn&eacute;es de sant&eacute;) repose sur votre consentement explicite, conform&eacute;ment &agrave; l'Article 9.2.a du RGPD. En saisissant ces informations dans l'application, vous consentez activement &agrave; leur traitement par SuiviBaby. Vous pouvez retirer ce consentement &agrave; tout moment en supprimant les donn&eacute;es concern&eacute;es ou en cl&ocirc;turant votre compte.</p>

    <h2>4. H&eacute;bergement et Transferts de donn&eacute;es</h2>
    <p>Vos donn&eacute;es sont h&eacute;berg&eacute;es par Google Firebase sur des serveurs s&eacute;curis&eacute;s situ&eacute;s dans la r&eacute;gion us-central1 (&Eacute;tats-Unis). Tout transfert &eacute;ventuel hors UE est encadr&eacute; par les Clauses Contractuelles Types (CCT) de la Commission Europ&eacute;enne pour garantir un niveau de protection &eacute;quivalent.</p>

    <h2>5. Conservation et Suppression des donn&eacute;es</h2>
    <p>Les donn&eacute;es sont conserv&eacute;es tant que votre compte est actif. En cas de demande de suppression par l'utilisateur, les donn&eacute;es sont imm&eacute;diatement effac&eacute;es de nos bases de production. Pour des raisons de s&eacute;curit&eacute; et de continuit&eacute; de service, leur effacement d&eacute;finitif de nos copies de sauvegarde (backups) peut toutefois prendre jusqu'&agrave; 60 jours. Apr&egrave;s 2 ans d'inactivit&eacute; totale, votre compte et ses donn&eacute;es associ&eacute;es seront automatiquement supprim&eacute;s.</p>

    <h2>6. S&eacute;curit&eacute; et Destinataires</h2>
    <p>Nous ne vendons, n'&eacute;changeons ni ne louons vos donn&eacute;es personnelles. Elles sont chiffr&eacute;es en transit (protocole TLS) et au repos (chiffrement AES-256). Seuls les services techniques de notre sous-traitant Google Firebase et les personnes que vous autorisez explicitement via les fonctions de partage de l'application ont acc&egrave;s aux donn&eacute;es.</p>

    <h2>7. Vos droits (RGPD)</h2>
    <p>Conform&eacute;ment &agrave; la r&eacute;glementation, vous disposez des droits d'acc&egrave;s, de rectification, de suppression, de portabilit&eacute; et de limitation du traitement de vos donn&eacute;es. Pour exercer ces droits, contactez-nous &agrave; <a href="mailto:privacy@suivibaby.com">privacy@suivibaby.com</a>. Vous avez &eacute;galement le droit d'introduire une r&eacute;clamation aupr&egrave;s de la <a href="https://www.cnil.fr" target="_blank">CNIL</a>.</p>

    <div class="footer">
      <p>Pour toute question : <a href="mailto:privacy@suivibaby.com">privacy@suivibaby.com</a></p>
      <p style="margin-top: 8px;">&copy; 2026 SuiviBaby</p>
    </div>
  </div>
</body>
</html>
